; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 574643 1 3 3 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	image0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Star4 thermograph2)
	(have_image Phenomenon5 image0)
	(have_image Star6 thermograph2)
	(have_image Star7 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
5. (take_image satellite0 star7 instrument0 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 1 of 5
6. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 1 of 5
7. (take_image satellite0 star6 instrument0 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon5 instrument0 image0)
   added: (have_image phenomenon5 image0)
   goals met: 3 of 5
10. (turn_to satellite0 groundstation0 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 5
11. (turn_to satellite0 star4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star4)
   goals met: 3 of 5
12. (take_image satellite0 star4 instrument0 thermograph2)
   added: (have_image star4 thermograph2)
   goals met: 4 of 5
13. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   goals met: 5 of 5
